/*
 * 이차원배열 [][]
 * *형식
 * 	1) 데이터형[][] 배열명 = 권장
 * 	2) 데이터형 배열명[][]
 * 	3) 데이터형[] 배열명[]
 * 		=> 행/열
 * 		데이터형[행][열]
 * *초기화
 * 	ex) int[][] arr={{1,2,3},{4,5,6},{7,8,9}; => 3행 3열
 * 		=========================
 * 			1		2		3
 * 		=========================
 *			4		5		6 
 *		=========================
 *			7		8		9 
 * 		=========================   => 가져올 때 arr[행][열]로 가져오면 됨  => 행열도 똑같이 0번부터 시작
 * 	
 * 		=> 이중 for문으로  : 퍼즐게임, 지뢰찾기, 빙고게임
 * 
 * 		
 * 
 */
public class 이차원배열 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//초기값 1~25
		int[][] arr=new int[5][5]; //5행5열 == 전체 0으로 초기화
		
		int k=1;
		//초기값
		for(int i=0;i<5;i++) //행
		{
			for(int j=0;j<5;j++) //열
			{
				arr[i][j]=k;
				k++;
			}
		}
		//출력
		for(int i=0;i<5;i++)
		{
			for(int j=0;j<5;j++)
			{
				System.out.printf("arr[%d][%d]=%d\t",i,j,arr[i][j]);
			}
			System.out.println();
		}
		
		
		
		
		
		
		
		
		
		
		
		

	}

}
